In [1]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt  

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

# DataFrame Copy
df_original = df.copy()

In [3]:
#To generate 10 samples of our data frame we can use:

df.sample(10)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
671166,Data Analyst,Data Analyst,"Poznań, Poland",via Adzuna.pl,Full-time,False,Poland,2023-11-23 10:21:09,True,False,Poland,None,NaN,NaN,LeasingTeam Group,None,None
166795,Senior Data Engineer,Senior Data Engineer | Leading International T...,"Milan, Metropolitan City of Milan, Italy",via Linkedin,Full-time,False,Italy,2023-06-30 15:17:12,True,False,Italy,None,NaN,NaN,Hays,"['sql', 'azure']","{'cloud': ['azure'], 'programming': ['sql']}"
528723,Data Scientist,Data Scientist / Computational Protein Engineer,Spain,via LinkedIn,Full-time,False,Spain,2023-06-12 11:32:18,False,False,Spain,None,NaN,NaN,Universitat Pompeu Fabra - Barcelona,None,None
684480,Senior Data Scientist,Senior Data Scientist (f/m/x),"Aalen, Germany",via Stepstone,Full-time,False,Germany,2023-12-22 10:18:19,False,False,Germany,None,NaN,NaN,ZEISS,"['python', 'r', 'sql', 'azure', 'aws', 'excel'...","{'analyst_tools': ['excel', 'tableau', 'power ..."
525736,Business Analyst,"Senior Business Analyst, Artificial Intelligence",Anywhere,via LinkedIn,Full-time,True,Australia,2023-09-06 11:39:01,False,False,Australia,None,NaN,NaN,Glamezy,"['python', 'java', 'sql', 'r', 'sas', 'sas', '...","{'analyst_tools': ['sas', 'power bi', 'tableau..."
289163,Data Engineer,Data Engineer - Contract to Hire,Anywhere,via Upwork,Full-time,True,Sudan,2023-08-12 17:32:41,False,True,Sudan,None,NaN,NaN,Upwork,"['python', 'sql', 'tableau']","{'analyst_tools': ['tableau'], 'programming': ..."
499411,Data Analyst,Operations Data Analyst - Full-time,Anywhere,via Snagajob,Full-time,True,"California, United States",2023-02-06 11:01:15,False,True,United States,None,NaN,NaN,KARL STORZ Endoscopy - America,"['sql', 'python', 'r', 'tableau', 'looker']","{'analyst_tools': ['tableau', 'looker'], 'prog..."
686132,Data Engineer,Data Engineer,Anywhere,via LinkedIn,Full-time,True,United Kingdom,2023-07-11 10:23:09,False,False,United Kingdom,None,NaN,NaN,BIPROCSI LTD,"['python', 'html', 'gcp', 'snowflake', 'looker']","{'analyst_tools': ['looker'], 'cloud': ['gcp',..."
658349,Data Scientist,Data Scientist,Anywhere,via LinkedIn,Full-time,True,Belgium,2023-09-19 10:23:10,False,False,Belgium,None,NaN,NaN,Engineering International Belgium,"['sql', 'azure', 'dax']","{'analyst_tools': ['dax'], 'cloud': ['azure'],..."
15423,Data Scientist,Data Scientist,"Palo Alto, CA",via Adzuna,Full-time,False,"California, United States",2023-02-13 13:04:41,False,False,United States,None,NaN,NaN,Sunshine,"['r', 'python', 'matlab', 'sql', 'pandas']","{'libraries': ['pandas'], 'programming': ['r',..."

In [4]:
#If you want to have the same results returned from a sample we can use:

df.sample(10, random_state=42)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
502901,Senior Data Engineer,Senior Data Engineer,"St Paul, MN",via BeBee,Full-time,False,"Florida, United States",2023-12-17 11:09:06,False,False,United States,None,NaN,NaN,ManpowerGroup,"['sql', 'azure', 'git']","{'cloud': ['azure'], 'other': ['git'], 'progra..."
406337,Senior Data Scientist,Senior Analytics Engineer,"London, UK",via LinkedIn,Full-time,False,United Kingdom,2023-10-06 16:09:56,False,False,United Kingdom,None,NaN,NaN,Harnham,"['sql', 'python', 'bigquery', 'snowflake', 'lo...","{'analyst_tools': ['looker'], 'cloud': ['bigqu..."
659951,Data Engineer,Data Engineer,"Newcastle upon Tyne, UK",via Indeed,Full-time,False,United Kingdom,2023-09-06 10:11:25,True,False,United Kingdom,None,NaN,NaN,Morgan King,None,None
541593,Data Analyst,Data Analyst,Malta,via Trabajo.org,Full-time,False,Malta,2023-02-14 21:14:18,True,False,Malta,None,NaN,NaN,Konnekt,['jira'],{'async': ['jira']}
425158,Senior Data Engineer,Senior Data Engineer. Job in Amsterdam NBC4i Jobs,"Amsterdam, Netherlands",via NBC4i Jobs,Full-time,False,Netherlands,2023-06-19 16:34:30,True,False,Netherlands,None,NaN,NaN,Independent Recruiters,['python'],{'programming': ['python']}
183426,Data Analyst,Data Analyst,Singapore,via Singapore | JobsDB,Full-time,False,Singapore,2023-11-09 16:07:57,False,False,Singapore,None,NaN,NaN,FLEXOSENSE PTE. LTD.,"['r', 'python', 'java', 'sql', 'sql server', '...","{'analyst_tools': ['tableau'], 'cloud': ['orac..."
287790,Data Analyst,Data Analyst,"Tampa, FL",via LinkedIn,Full-time,False,"Florida, United States",2023-07-14 17:02:23,True,False,United States,None,NaN,NaN,Iris Software Inc.,"['sql', 'hadoop', 'excel']","{'analyst_tools': ['excel'], 'libraries': ['ha..."
541983,Data Analyst,"Data Analyst, Cloud Systems Jobs","Chantilly, VA",via Clearance Jobs,Full-time,False,Georgia,2023-06-15 19:44:34,False,False,United States,None,NaN,NaN,SAIC,"['sql', 'r', 'matlab', 'python', 'oracle', 'aw...","{'analyst_tools': ['power bi', 'tableau', 'qli..."
416896,Data Scientist,Alternant Actuariat & Data Science H/F,France,via LinkedIn,Full-time,False,France,2023-09-22 16:47:24,False,False,France,None,NaN,NaN,KPMG France,None,None
780907,Data Engineer,"Data Engineer with Fivetran,Qlik Must","Mexico City, CDMX, Mexico",via BeBee México,Full-time,False,Mexico,2023-01-16 06:19:09,False,False,Mexico,None,NaN,NaN,CORUS Consulting,"['oracle', 'snowflake', 'aws', 'azure', 'alter...","{'analyst_tools': ['alteryx'], 'cloud': ['orac..."

**Copy**

It makes a copy of this object's indices and data.

In [5]:
dataset = load_dataset('lukebarousse/data_jobs')
df_original = dataset['train'].to_pandas()

In [6]:
df_altered = df_original

In [7]:
median_salary = df_altered['salary_year_avg'].median()

median_salary

115000.0

In [8]:
df_altered['salary_year_avg'] = df_altered['salary_year_avg'].fillna(median_salary)

df_altered.loc[:5, 'salary_year_avg']

0    115000.0
1    115000.0
2    115000.0
3    115000.0
4    115000.0
5    115000.0
Name: salary_year_avg, dtype: float64

In [9]:
dataset = load_dataset('lukebarousse/data_jobs')
df_original = dataset['train'].to_pandas()

In [10]:
df_altered = df_original.copy()

In [11]:
print('ID of df_original:               ', id(df_original))
print('ID of df_altered:                ', id(df_altered))
print('Are the two dataframes the same? ', id(df_original) == id(df_altered))

ID of df_original:                5596646480
ID of df_altered:                 5851424080
Are the two dataframes the same?  False

In [15]:
#Here we are altering the contents of the df_altered data frame and not the original data frame

median_salary = df_altered['salary_year_avg'].median()

df_altered['salary_year_avg'] = df_altered['salary_year_avg'].fillna(median_salary)

df_altered.loc[:5, 'salary_year_avg']

0    115000.0
1    115000.0
2    115000.0
3    115000.0
4    115000.0
5    115000.0
Name: salary_year_avg, dtype: float64

In [16]:
#This is to confirm that the original data frame is not altered

df_original.loc[:5, 'salary_year_avg']

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
Name: salary_year_avg, dtype: float64

In [17]:
print('ID of df_original:               ', id(df_original))
print('ID of df_altered:                ', id(df_altered))
print('Are the two dataframes the same? ', id(df_original) == id(df_altered))

ID of df_original:                5596646480
ID of df_altered:                 5851424080
Are the two dataframes the same?  False